#!/usr/bin/env python
# coding: utf-8

# In[69]:


Duration = [53, 153, 4153, 400153]
a = 0
for idx in Duration:
        
    a += idx
    if a // 60 < 1:
        print(a,' сек')
    elif a / (60*60*24) > 1:
        a1 = a // (60*60*24)
        a2 = (a - a1 * (60*60*24)) // (60*60)
        a3 = (a - a2 * (60*60) -  a1 * (60*60*24)) // (60)
        a4 = (a - a3 * (60)- a2 * (60*60) -  a1 * (60*60*24)) 
        print(a1,' дней', a2,' часов', a3,' минут', a4,' секунд')
    elif a / (60*60) > 1:
        a1 = a // (60*60*24)
        a2 = (a - a1 * (60*60*24)) // (60*60)
        a3 = (a - a2 * (60*60) -  a1 * (60*60*24)) // (60)
        a4 = (a - a3 * (60)- a2 * (60*60) -  a1 * (60*60*24)) 
        print(a2,' часов', a3,' минут', a4,' секунд')
    else:
        a1 = a // (60*60*24)
        a2 = (a - a1 * (60*60*24)) // (60*60)
        a3 = (a - a2 * (60*60) -  a1 * (60*60*24)) // (60)
        a4 = (a - a3 * (60)- a2 * (60*60) -  a1 * (60*60*24)) 
        print(a3,' минут', a4,' секунд')
        





